
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
        ТаблицаСоСтруктурой = ПолучитьСтруктуруХраненияБазыДанных();
    ТаблицаСоСтруктурой.Сортировать("Метаданные, ИмяТаблицыХранения");
    
    
    Н = Наборы.НовыйНабор();
    ДобавляемыеРеквизиты = Наборы.ЗадатьДанные(Н, ТаблицаСоСтруктурой.Колонки)
                                 .Отбор(Н, "Элемент.Имя <> ""Поля"" И Элемент.Имя <> ""Индексы"";")
                                 .Выбрать(Н, "Новый РеквизитФормы(Элемент.Имя
                                                              | , Элемент.ТипЗначения
                                                              | , ""ТЗ""
                                                              | , Элемент.Заголовок);")
                                 .ВМассив(Н);
    ИзменитьРеквизиты(ДобавляемыеРеквизиты);
    
    //Т1 = ТекущаяУниверсальнаяДатаВМиллисекундах();             
    Наборы.ЗадатьДанные(Н, ТаблицаСоСтруктурой.Колонки)
          .Отбор(Н, "Элемент.Имя <> ""Поля"" И Элемент.Имя <> ""Индексы"";")
          .Выбрать(Н, "Элементы.Добавить(Элемент.Имя
                                     | , Тип(""ПолеФормы"")
                                     | , Элементы[""ТЗ""]);"
                    , Новый Структура("Элементы", Элементы))
          .ДляКаждого(Н, "Элемент.ПутьКДанным = ""ТЗ.""+ Элемент.Имя;");
    
    //Т2 = ТекущаяУниверсальнаяДатаВМиллисекундах();
    //Т3 = ТекущаяУниверсальнаяДатаВМиллисекундах();
    //Для каждого Элемент Из ТаблицаСоСтруктурой.Колонки Цикл
    //    Если Элемент.Имя <> "Поля" И Элемент.Имя <> "Индексы" Тогда
    //    	  ТТ = Элементы.Добавить("Ц" + Элемент.Имя, Тип("ПолеФормы"), Элементы["ТЗ"]);
    //        ТТ.ПутьКДанным = "ТЗ."+ Элемент.Имя;
    //    КонецЕсли;     	
    //КонецЦикла; 
    //Т4 = ТекущаяУниверсальнаяДатаВМиллисекундах();
    //Сообщить(Т2-Т1);
    //Сообщить(Т4-Т3);
    ЗначениеВРеквизитФормы(ТаблицаСоСтруктурой, "ТЗ");
КонецПроцедуры
